#ifndef MCP2515_DEFS_H
#define MCP2515_DEFS_H
#include "esp_err.h"
#include "can.h"

/*****************************************************************************/
/*************         VCC  5V 电源输入引脚                    ***************/
/*************         GND  电源地引脚                         ***************/
/*************         CS   SPI SLAVE 选择引脚 (低电平有效)    ***************/
/*************         SO   SPI 主机输入从机输出引脚           ***************/
/*************         SI   SPI 主机输出从机输入引脚           ***************/
/*************         SCLK SPI 时钟引脚                       ***************/
/*************         INT  MCP2515 中断引脚                   ***************/
/*************         J1   120R 电阻终端选择                  ***************/
/*************         J2   CANH、CANL KF301-2P 座输出         ***************/
/*************         J3   CANH、CANL 排针输出                ***************/
/*****************************************************************************/
/*************         因为本人用ESP32-S3-DevKitC-1            ***************/
/*************         所以接线如下:                           ***************/
/*************         VCC  ------------  5V                   ***************/
/*************         GND  ------------  GND                  ***************/
/*************         CS   ------------  10(GPIO10)           ***************/
/*************         SO   ------------  13(GPIO13)           ***************/
/*************         SI   ------------  11(GPIO11)           ***************/
/*************         SCLK ------------  12(GPIO12)           ***************/
/*************         INT  ------------  17(GPIO17)           ***************/
/*************      CS/SO/SI/SCLK 均在spi_routine.c中定义      ***************/
/*****************************************************************************/

/* In Microseconds, May need changed depending on application and baud rate */
#define TIMEOUTVALUE    2500  

/* TXBn(发送缓冲器) RXBn(接受缓冲器) RXFn(验收滤波寄存器) RXMn(验收屏蔽寄存器) */
/* 都是这么一个数组排列下来的, 所以index都这么定义 */
#define MCP_SIDH        0
#define MCP_SIDL        1
#define MCP_EID8        2
#define MCP_EID0        3

/* In TXBnSIDL */
#define MCP_TXB_EXIDE_M     0x08
/* 4 LSBits */
#define MCP_DLC_MASK        0x0F

/* (1<<6) Bit 6                 */
#define MCP_RTR_MASK        0x40

/*****************************************************************************/
/*****  R = 可读位   W = 可写位   U = 未用位,读为 0                      *****/
/*****  -n = 上电复位时的值   1=置1    0 = 清零    x = 未知值            *****/
/*****   bit7  bit6  bit5  bit4  bit3  bit2  bit1  bit0  这个顺序排下来  *****/
/*****                                                                   *****/
/*****  TXBnCTRL --- 发送缓冲器 n 控制寄存器 (地址:30h, 40h, 50h)        *****/
/*****   U-0 |  R-0  |  R-0  | R-0   | R/W-0 | U-0 | R/W-0 | R/W-0       *****/
/*****    -  |  ABTF |  MLOA | TXERR | TXREQ |  -  | TXP1  | TXP0        *****/
/*****************************************************************************/
/*****  TXRTSCTRL --- TXnRTS 引脚控制和状态寄存器 (地址:0Dh)             *****/
/*****   U-0 | U-0 |  R-x  |  R-x  |  R-x  | R/W-0  | R/W-0  | R/W-0     *****/
/*****    -  |  -  | B2RTS | B1RTS | B0RTS | B2RTSM | B1RTSM | B0RTSM    *****/
/*****************************************************************************/
/*****  TXBnSIDH --- 发送缓冲器 n 标准标识符高位 (地址:31h, 41h, 51h)    *****/
/*****  R/W-x | R/W-x | R/W-x | R/W-x | R/W-x | R/W-x | R/W-x | R/W-x    *****/
/*****  SID10 |  SID9 | SID8  | SID7  | SID6  | SID5  | SID4  | SID3     *****/
/*****************************************************************************/
/*****  TXBnSIDL --- 发送缓冲器 n 标准标识符低位 (地址:32h, 42h, 52h)    *****/

/*****  TXBnEID8 --- 发送缓冲器 n 扩展标识符高位 (地址:33h, 43h, 53h)    *****/

/*****  TXBnEID0 --- 发送缓冲器 n 扩展标识符低位 (地址:34h, 44h, 54h)    *****/

/*****  TXBnDLC --- 发送缓冲器 n 数据长度码 (地址:35h, 45h, 55h)          *****/
/*****  TXBnDm --- 发送缓冲器 n 数据字节 m                                *****/
/*****  (地址:36h - 3Dh, 46h - 4Dh, 56h - 5Dh)                           *****/
/*****************************************************************************/
/*****  RXB0CTRL--接收缓冲器 0 控制寄存器 (地址:60h)                *****/
/*****  RXB1CTRL--接收缓冲器 1 控制寄存器 (地址:70h)                *****/
/*****  BFPCTRL--RXnBF 引脚控制寄存器和状态寄存器 (地址:0Ch)        *****/
/*****  RXBnSIDH--接收缓冲器 n 标准标识符高位 (地址:61h, 71h)      *****/
/*****  RXBnSIDL--接收缓冲器 n 标准标识符低位 (地址:62h, 72h)      *****/
/*****  RXBnEID8--接收缓冲器 n 扩展标识符高位 (地址:63h, 73h)      *****/
/*****  RXBnEID0--接收缓冲器 n 扩展标识符低位 (地址:64h, 74h)      *****/
/*****  RXBnDLC--接收缓冲器 n 数据长度码 (地址:65h, 75h)           *****/
/*****  RXBnDM--接收缓冲器 n 数据字段字节 M                            *****/
/*****  (地址:66h - 6Dh, 76h - 7Dh)                                  *****/
/*****************************************************************************/
/*****  RXFnSIDH--验收滤波寄存器 n 标准标识符高位                      *****/
/*****  (地址:00h, 04h, 08h, 10h, 14h, 18h)                      *****/
/*****  RXFnSIDL--验收滤波寄存器 n 标准标识符低位                      *****/
/*****  (地址:01h, 05h, 09h, 11h, 15h, 19h)                      *****/
/*****  RXFnEID8--验收滤波寄存器 n 扩展标识符高位                      *****/
/*****  (地址:02h, 06h, 0Ah, 12h, 16h, 1Ah)                      *****/
/*****  RXFnEID0--验收滤波寄存器 n 扩展标识符低位                      *****/
/*****  (地址:03h, 07h, 0Bh, 13h, 17h, 1Bh)                      *****/
/*****  RXMnSIDH--验收屏蔽寄存器 n 标准标识符高位 (地址:20h, 24h)  *****/
/*****  RXMnSIDL--验收屏蔽滤波器 n 标准标识符低位 (地址:21h, 25h)  *****/
/*****  RXMnEID8--验收屏蔽寄存器 n 扩展标识符高位 (地址:22h, 26h)  *****/
/*****  RXMnEID0--验收屏蔽寄存器 n 扩展标识符低位 (地址:23h, 27h)  *****/
/*****************************************************************************/
/*****  CNF1--配置寄存器 1 (地址:2Ah)                               *****/
/*****  CNF2--配置寄存器 2 (地址:29h)                               *****/
/*****  CNF3--配置寄存器 3 (地址:28h)                               *****/
/*****************************************************************************/
/*****  TEC--发送错误计数器 (地址:1Ch)                              *****/
/*****  REC--接收错误计数器 (地址:1Dh)                              *****/
/*****  EFLG--错误标志寄存器 (地址:2Dh)                             *****/
/*****************************************************************************/
/*****  CANINTE--中断使能寄存器 (地址:2Bh)                          *****/
/*****  CANINTF--中断标志寄存器 (地址:2Ch)                          *****/
/*****************************************************************************/
/*****  CANCTRL--CAN 控制寄存器 (地址:XFh)                          *****/
/*****  CANSTAT--CAN 状态寄存器 (地址:XEh)                          *****/
/*****************************************************************************/

#if defined CONFIG_IDF_TARGET_ESP32
#define CAN_INT 16
#elif defined CONFIG_IDF_TARGET_ESP32S3
#define CAN_INT 17
#endif

#define GPIO_OUTPUT_PIN_SEL  (1ULL<<CAN_INT )
#define OPEN_MODE  0x00
#define LOOPBACK_MODE 0x40
#define CONFIG_MODE 0x80


#endif //MCP2515_DEFS_H
